# SharedParametersFilename Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ControlledApplication..::..SharedParametersFilename Property
ControlledApplication Class See Also
---
Contains the fully qualified path to a shared parameters file.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string SharedParametersFilename { get; set; }
```

Visual Basic
---
```text
Public Property SharedParametersFilename As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SharedParametersFilename {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
This path can be read and set via this property. By default Autodesk Revit does not have a shared parameters file so this property must be set before access is made to the shared parameters file object otherwise an exception will be thrown.
# See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace